{
    "art": [
        {
            "name": "Mizzle",
            "src": "Mizzle (Deltarune).png",
            "alt": "Pixelated art piece of a an enemy from deltarune called Mizzle. She's a light blue water spirit with a long snout, wearing a slightly darker dress, and a blue-white hat with pon pons similar to a jester hat. She's holding both hands on her chest with her eyes closed. Sleeping Z particles are coming out.",
            "description": "I loveeeee Mizzleeeee..."
        },   
        {
            "name": "Early Morning Stroll to Work",
            "src": "Early-Morning-Walk-To-Work.png",
            "alt": "Pixelated art piece of a deer Harvey in a yellow raincoat, holding a green umbrella. Looking sad into the raining sky under the light of a lamppost. A cyan glow radiating from him, representing his ghost boyfriend Solas near him.",
            "description": "Yeah.. it's a weekend, yeah... the weather is shit, but a critical vulnarability is critical vulnarability, gotta patch that ASAP..."
        },       
        {
            "name": "Lenn",
            "src": "Lenn.png",
            "alt": "A pixelated art piece of a 3/4 moth and 1/4 bat character. She has pink skin, blue wings and antennae. She's wearing a black shirt with a positively charge Pyro-Cryo Elemental Bond. Text on the top says: \"Manager of development at Phyro Archival Services\". Company logo in the opposite corner, representing an ice crystal, with an orange Plus, green 0 and a blue Minus in the top, middle and bottom respectively.",
            "description": "Harvey's Manager of development at his work place."
        },        
        {
            "name": "Harvey x Solas",
            "src": "Ghost Snek x Deer.png",
            "alt": "A low resolution pixel drawing of a deer hugging a laptop with a console window opened on it. A cyan ghost snake with white lines going all around his body is coming out of a screen weaving around a deer and going for a kiss. The deer has faint brown-red fur, green eyes, and red circles around them. Text layered above drawing: And though for now between us there might be a screen; You're my ghost boyfriend in the terminal of dream",
            "description": "My two favourite cuddlebugs..."
        },        
        {
            "name": "Bitgal",
            "src": "bit_gal.png",
            "alt": "Pixelated art peace of an anthropomorphic arcade cabinet, with \"Bit-Gal\" saying on top of it. Cabinet itself is blue, has a red joystick on the left of controller panel, and four buttons (red, green, blue, and yellow) on the right. She has flexible mechanical arms and legs. She's dual wielding uzis. Her facial expression is angry.",
            "description": "Fan art of OC by Axovoxel"
        },
        {
            "name": "Frysen the Cryomancer Arctic Fox",
            "src": "Frysen.png",
            "alt": "A pixelated art peace of an ice wielding arctic fox named Frysen. He's got black colored fur, white ears, tail is black with a white tip. Palms and feet are white, arms and legs are dark-ish cyan. His eyes have blue and orange dual iris. He's got a faint scar on his chest.",
            "description": "Overseer of the element of Ice"
        },        
        {
            "name": "Hamester the Pyromancer Arctic Fox",
            "src": "Hamester.png",
            "alt": "Pixelated art peace of an anthropomorphic fire wielding arctic fox. Their fur base color is white, their arms and legs have a black to brown to orange to light orange gradient going from tip to shoulders, and waist respectfully. Their tail is also white with a black tip. Their eyes have a dual-colored blue and orange iris. Their ears are black with brown lynx-like tuft. Their body type is androgynous.",
            "description": "Overseer of the element of Fire"
        },    
        {
            "name": "Loney",
            "src": "Loney.png",
            "alt": "Pixelated art piece of a sad anthropomorphic cat floating in deep space. He has cyan fur, a dark cyan antenna with red tint at the very tip with signal lines going outwards. He has dark cyan markings on his face, tail and feet. Near him floats a diary with red writing in it and a red pencil. There are orange green and pink planets in the background.",
            "description": "Lyrical character of my poems \"Loney's Message\" and \"Loney's Regret\". Imagined him as an alien-like cat with antenna on top of his head."
        },            
        {
            "name": "Leelo",
            "src": "Leelo.png",
            "alt": "A pixelated drawing of an anthropomorphic cat with dark purple fur, bright purple eyes, wearing light grey shoulder-cuts shirt with neon purple skull on the print, darker purple shorts. She wields a sword.",
            "description": "Leelo in my current style"
        },     
        {
            "name": "Happy Birthday, Redstoad!",
            "src": "happy bd reds.png",
            "alt": "A pixelated art piece of a toad from Super Mario series (a mushroom person in a red vest, mushroom head with red pips, not a real life toad), who looks excited, jumping out of the top of the gift box with red band, ripping the top part of it. colorful confetti flying all around. Background is gradient de saturated green-cyan dithered gradient",
            "description": "Birthday drawing for RedsToad"
        },     
        {
            "name": "Tamuth the Fthoramancer Moth",
            "src": "tamuth.png",
            "alt": "Pixel art of a anthropomorphic (humanoid) moth, with orange antennae, dark slightly de-saturated brown body with yellow-green de-saturated glowing markings across her legs and arms, with dark brown gradient going down her body arms and legs, orange-red neck-fluff and wings, each wing has a brown ankh-resembling symbol, and o. She's holding a dark wooden stuff with resembling shepherd's stuff engraved with bones.",
            "description": "Overseer of the element of Rot"
        },        
        {
            "name": "Phaenah the Physiomancer Moth",
            "src": "phaenah.png",
            "alt": "An anthropomorphic (humanoid) moth. Her fur color is slightly de-saturated yellow. She's got green vines hanging off her arms and legs. She holds a birch wand with cyan glowing orb on top of it. She's got bright yellow glowing antennae, greenish-blue hair and yellow cloth belt. Her wings are greenish-blue. Her neck-fluff is brownish.",
            "description": "Overseer of the element of Nature"
        },        
        {
            "name": "Scug Minecraft Skin",
            "src": "scug.gif",
            "alt": "Minecraft skin of an anthtropomorphic pink slug cat from the game Rain World, wearing engineer goggles",
            "description": "Minecraft skin of my friend kopian4's OC"
        },        
        {
            "name": "Bagels Minecraft Skin",
            "src": "bagels_clothes.gif",
            "alt": "Minecraft skin of an anthtropomorphic green bird wearing gray shirt",
            "description": "Minecraft skin of my friend Baker Dozen Bagel's OC"
        },        
        {
            "name": "Vibri",
            "src": "vibri.png",
            "alt": "A pixelated artwork of a white bunny made entirely of lines on the black backaround with white and gray shapes",
            "description": "Pixel art of Vibri I made for 25th anniversary of the game"
        },        
        {
            "name": "The Nucleus",
            "src": "The Nucleus.png",
            "alt": "Symbolic representation of elements in The Nucleus, Time in the middle, Space (a purple viper) on the outside, Fire, Water, Air, Earth, Vapor, Ice, Rot, and Nature",
            "description": "Symbolic representation of one of the main locations in my lore universe Libra Elementum"
        },        
        {
            "name": "Leelo Pixel Art",
            "src": "Leelo_pxl.png",
            "alt": "Pixel art of a purple cat, wearing grey shirt with magenta skull print, and dark purple shorts, weilding a knife.",
            "description": "Pixel art of my OC Leelo"
        },        
        {
            "name": "Hamester",
            "src": "Me.png",
            "alt": "Pixel art of an arctic fox with white fur, Their fur base color is white, their arms have a black to brown to orange to light orange gradient going from tip to shoulders. Their eyes have a dual-colored blue and orange iris. Their ears are black with brown lynx-like tuft.",
            "description": "Old pixel art of my OC Hamester"
        },     
        {
            "name": "Axi",
            "src": "Axi.png",
            "alt": "Pixel art of a pink anthropomorphic axolotl with light blue gills, with hands prepared for a hug. Speech bubble says: \"Hugs?\"",
            "description": "Fanart of an axolotl OC by Axovoxel"
        },     
        {
            "name": "Dellsin",
            "src": "Dellsin2.png",
            "alt": "Pixel art of an anthropomorphic spider with orange hair, wearing blue and yellow overalls, holding a peacve of redstone dust",
            "description": "Fanart of a spdier OC Dellsin OC by NerdySpider"
        },     
        {
            "name": "Ruthless Hamester",
            "src": "HamesterRuthless.png",
            "alt": "Pixel art of an anthropomorphic artic fox with white fur, throwing a fireflower into the trash bin, saying \"Useless Shit\"",
            "description": "Hamester is a pyromancer, so fireflower would be pretty useless for him... Very out of character nowadays."
        },     
        {
            "name": "Not Like Reds",
            "src": "NotLikeReds.png",
            "alt": "Pixel art sticker of a Super Mario Toad with red and white head looking distressed and holding his head.",
            "description": "Parody of emoticon NotLikeBlob of Redstoad's OC. Was meant to be used as a sticker."
        },     
        {
            "name": "Sedosa Heart",
            "src": "sedosa_heart.png",
            "alt": "Pixel art of a moth character Sedosa, she has pink hair, pink and red bushy antenna, pink wings. Stretching her arms in the shape of a heart.",
            "description": "Fanart of a moth OC Sedosa by Axovoxel"
        },     
        {
            "name": "Sedosa Old Design",
            "src": "Sedosa.png",
            "alt": "Pixel art of a moth character Sedosa, she has white fur, grey neck-fluff and wings.",
            "description": "Fanart of a moth OC Sedosa by Axovoxel (very old design)"
        },     
        {
            "name": "Emik Working",
            "src": "EmikWorking.png",
            "alt": "Pixel art of a cyan pikachu working on laptop sitting on a black transparent desk.",
            "description": "Old art of Emik's cyan pikachu character coding away."
        },     
        {
            "name": "Emik Icon",
            "src": "EmikProfilePic.png",
            "alt": "Pixel art of a cyan pikachu.",
            "description": "Old art of Emik's cyan pikachu character."
        },     
        {
            "name": "Crawron Icon",
            "src": "Crawron.png",
            "alt": "Profile view of a black craw with a grey beak in a brown jacket, looking to the left.",
            "description": "Pixle art pieace of my friend Crawron's old profile picture"
        },     
        {
            "name": "Etterna",
            "src": "Etterna.png",
            "alt": "Pixel art of gameplay of the game Etterna. BPM: 120. Difficulty: 14.53. Accuracy: 92.56%. Colorful Arrows scrolling up to the receptors above.",
            "description": "Etterna gameplay pixel art. I was really into that game."
        },     
        {
            "name": "DDR",
            "src": "DDR.png",
            "alt": "Pixel art of a DDR machine.",
            "description": "DDR machine. I really liked the perspective art back then."
        },     
        {
            "name": "Shadles",
            "src": "Shadles.png",
            "alt": "Pixel art of gameplay of a grey wolf with green eyes, pn a green background",
            "description": "Really old pixel art for a person from old reddit group chat."
        },     
        {
            "name": "Wolfy",
            "src": "Wolfy2.png",
            "alt": "Pixel art of a grey wold with pink belly and ears, wearing earbuds and lsitenning to music on a pink background.",
            "description": "Really old pixel art for a person from old reddit group chat."
        }
    ]
}