{
    "posts": [
        {
            "title": "Long time no update",
            "date": "18.04.2025",
            "text": [
                "Been a few month since I've updated the website, been more active on <a target=\"_blank\" href=\"https://bsky.app/profile/hamester.bsky.social\">Bluesky</a>, but not really at the same time...",
                "Been working on some <a target=\"_blank\" href=\"https://bsky.app/profile/hamester.bsky.social/post/3lmxhgpmt7k2u\">Balatro mods</a>, haven't been writing much poetry and still procrastinating on adding section for all this to the website, as well as updating my wiki section with more info on my characters, cause... I haven't been working on the universe much at all, other than random side characters... Probably not soon, but working on it is certainly something I wanna do, as well as developing this website a bit more... Currently wiki section is unaccessible until I figure out the way to update it more efficiently, like with... Obsidian integration into my workflow, I guess.",
                "Also, completed Omori, it was an amazing experience..."
            ],
            "image": {
                "src": "content/img/feed/wild.png",
                "style": "square",
                "width": 250
            }
        },
        {
            "title": "They/them - here I am",
            "date": "09.01.2025",
            "text": [
                "After some thinking I've come to a conclusion that I don't really fit decisively into any of the ends of the gender spectrum... so... from now on I'll be going by they/them pronouns",
                "Also since last post I wrote some new poems and posted them on my <a target=\"_blank\" href=\"https://bsky.app/profile/hamester.bsky.social\">Bluesky</a>. Will probably create a separate section for them on this website in the near future."
            ],
            "image": {
                "src": "content/img/feed/nonbinary_flag.png",
                "style": "square",
                "width": 250
            }
        },
        {
            "title": "A poem...",
            "date": "02.12.2024",
            "text": [
                "A cute poem I wrote... Originally there was only the first half, but today I had inspiration to continue it... maybe I'll add to it in the future, who knows?",
                "<center><img class=\"square\" width=\"650\" src=\"content/img/feed/poem1.png\"></center>"
            ]
        },
        {
            "title": "Made a BlueSky",
            "date": "24.11.2024",
            "text": [
                "Decided to make a <a target=\"_blank\" href=\"https://bsky.app/profile/hamester.bsky.social\">BlueSky Account</a>, where I'm gonna post random stuff I make I guess... and If I'm gonna post something into this feed I'll probably also repost it on BlueSky as a post.",
                "I had conflicting thoughts about having to post same things on multiple platforms and I am a big fan of an idea of unified platform where I can post everything, and... That's what this personal website was trying to accomplish all this time, but... I believe it's fine to keep some redundancy for BlueSky too, besides I'm already posting my music on Newgrounds, so.. fuck it, we ball..."
            ],
            "image": {
                "src": "content/img/feed/bsky.png",
                "style": "square"
            }
        },
        {
            "title": "Been a while...",
            "date": "04.09.2024",
            "text": [
                "It's been almost 2 months since last post, and honestly... idk, nothing really changed, nothing really happened. It's been on and off a bunch of unproductive days with really rare occasional \"I did something!\". Been pretty depressive, mostly my brain switching between being excited to do something and then a few minutes later this exact excitement diminishing away. So much stuff I just can't get my endorphin deprived brain to do, nothing feels worth it most of the time. Playing games feels like an unfulfilling waste of time, and consuming content feels weird without creating anything new yourself in the world where time waits for nobody.",
                "On the programming front I haven't done much at all... There was some breakthrough on the music side of my artistic endeavors, for the first time in a few years in an 8 hour session I managed to make a song I could call \"finished\". It's called Das Faya, and you can listen to it either on my <a href=\"/#/music\">Music</a> page or on my <a target=\"_blank\" href=\"https://hamester.newgrounds.com/\">Newgrounds</a> page on which maybe I'll start posting some art I've made before, but I'm not sure, mostly because I like the idea of posting everything in one place to reduce redundancy, and that's what this website was supposed to be in a nutshell, a unified hub for everything me and what I make, so if I do post my art it would probably be here, but at the same time I understand that you can't count on acquiring audience from a personal website if nobody knows who you are, so... yeah.",
                "I started to follow a new musical artist I like recently, their name is <a target=\"_blank\" href=\"https://mididuck.carrd.co/\">mididuck</a> and their first full album \"ok to be not ok\" is dropping September 7th, and the singles he released in the last few weeks were of outmost greatness, so I can't wait to hear the rest of it. Also first studio album of my favorite musical artist Porter Robinson \"Worlds\" turned 10 years, and he dropped a previously unreleased song from it called \"Hollowheart\" and it's probably one the most beautiful \"Worlds\" era songs, despite him saying that it was supposed to be just an interlude, I genuinely cried when it played during \"Worlds\" listening party."
            ],
            "image": {
                "src": "content/img/feed/latest_audio.png",
                "style": "square"
            }
        },
        {
            "title": "New character?",
            "date": "14.07.2024",
            "text": [
                "Had a weird dream today: the arc was something like... there was some sort of school assignment or something I had to do, and as a result my brain came up with a new original character for myself. And I could really vividly see it in my dream: it was like a dark purple cat, wearing a grey shirt with a purple/pink skull.",
                "Also my brain came up with some basic lore, namely that she used to be into gambling, and that she used to be royal guard back from like IX century AD or something who was reincarnated as a cat person in modern days.",
                "I really liked the idea and decided to make a pixel art of her soon after waking up. I took a lot of inspiration from Mae Borowski from Night in the Woods, and I even see her as having a similar temper. I love her!"
            ],
            "image": {
                "src": "content/img/feed/Leelo.png",
                "style": "square"
            }
        },
        {
            "title": "I need a break...",
            "date": "06.07.2024",
            "text": [
                "Haven't been posting for a while, and I think I got burned out from working on Hit Indication... I won't get into too much detail of what caused it, but I can assure whoever is reading this, its not anyone's fault.",
                "I realized how spaghetti and bloated Hit Indication has become, and I decided to take a break from working on it for undetermined amount of time. After my break I'm planning to take my time in refactoring some code and not rushing to get it updates out.",
                "I've also decided to limit the releases to only 3 main Minecraft versions: 1.12.2, 1.16.5, 1.18.2 and not taking feature requests to avoid any further burn out. You will still be able to download older versions of the mod for earlier supported Minecraft versions, but they will not be receiving any new features. Thank you for your understanding."
            ],
            "image": {
                "src": "content/img/feed/sad_fox.png",
                "style": "square",
                "width": 250
            }
        },
        {
            "title": "New Hit Indication Update",
            "date": "24.06.2024",
            "text": [
                "Well, today has been a long day of debugging my math, and propagating all new features to all supported by Hit Indication Minecraft versions!.. Took longer than I excepted, as always... But, hey, now you can configure color of indicators and you can enable edge of screen indicators in place of normal ones that they appear around your crosshair, because some people prefer those instead.",
                "Haven't been working on wiki much... also new update for Random Respawns and another small inventory related mod is coming soon..."
            ],
            "image": {
                "src": "content/img/feed/is_this_javascript.png",
                "style": "square",
                "width": 250
            }
        },
        {
            "title": "Nothing Much",
            "date": "22.06.2024",
            "text": [
                "Not much progress made on the wiki. I did pick a name for the universe, and decided to call it Libra Elemetum, which is Latin for something like \"Element of Balance\". I fixed a few typos today, improved navigation, and added the ability to view full resolution versions of images when you click on them in the content pages. Also I made a cute pixel art yesterday, representing more symbolically how <a href=\"#/wiki/locations/the-nucleus\">The Nucleus</a> is laid out, you can see it on the <a href=\"#/wiki/overseers\">Overseers</a> page.",
                "Other than that, didn't make much progress on developing the characters or locations, just tiny additions and tried to pick color pallettes for them, which you can see in the post image. Those are in no way final, I don't think. They certainly need tweaking, especially I need to come up with more features for <a href=\"#/wiki/overseers/hyra\">Hyra</a> and <a href=\"#/wiki/overseers/paraoh\">Paraoh</a>. I'm not sure I'm completely happy with the colors, and I still need to come up with distinct designs for the remaining overseers. Preferably something actually original and not just generic shark, griffon vulture, or whatever. <a href=\"#/wiki/overseers/zemothel\">Zemothel</a> currently feels like any other vulture character. Maybe outfits is what will make them unique and not body coloring. Stuff like that always was really difficult for me."
            ],
            "image": {
                "src": "content/img/feed/pallets.png",
                "style": "square",
                "width": 300
            }
        },
        {
            "title": "New Mod!!",
            "date": "20.06.2024",
            "text": [
                "I released a new small mod that changes the way respawn mechanics work by randomizing the respawn location after each death, making it like semi-hardcore(ish).",
                "You can read more about what config options you can change on the CurseForge, Modrinth, GitHub, or info in the Projects tab."
            ],
            "image": {
                "src": "content/img/feed/random-respawns.png",
                "style": "square",
                "width": 200
            }
        },
        {
            "title": "Hit Indicate my Balls",
            "date": "19.06.2024",
            "text": [
                "Today I've been porting my Hit Indication mod to a new Minecraft version 1.21... Usually takes like an hour max: Forge setup, it would do all the decomp for the first time (20 minutes), I would copy all the files from previous version, change a few method names here and there, and I would be good to go...",
                "Well... decomp did take 20 minutes... to then throw an OutOfMemory exception... after like an hour of trying giving it more RAM, and waiting, I figured I had to set Java version in IntelliJ to Java21, and then the exception didn't happen.",
                "Ok... now the copying thing, just a few changes with how some objects are created and how you get potion effects from the item stack, not that hard... except for when it came to the main thing - <b>RENDERING THE INDICATORS</b>. They completely removed any event related to Gui rendering, and I only found out why when I looked through the forge commit history, because Mojang implemented a better system for layered GUI rendering... which, of course, they didn't leave any API to access... Long story short, I ended up using mixins, for a mod that was going strong without them for a while.",
                "And then I find out that those APIs do exist in NeoForge, and Forge API feature request template even links to NeoForge Discord server, and to this day I was really confused about what's even the reason there are two different incompatible forks of forge, and it's some drama or something... Maybe I do need to move to NeoForge instead for newer versions of Minecraft idk.",
                "Anyway, rant over, been quite a ride today, Hit Indication for 1.21 is out, probably not a big deal, but it IS FOR ME!! Also might release a smaller mod at request of a friend that respawns you in a random location each time you die for 1.18.2, nothing big."
            ],
            "image": {
                "src": "content/img/feed/out_of_memory.png",
                "style": "square",
                "width": 300
            }
        },
        {
            "title": "Wiki Section",
            "date": "17.06.2024",
            "text": [
                "New website update! Replaced character section with Wiki Section! Currently there's not a lot written, and a lot of the pages are pretty empty, but in the future I do plan on expanding the universe of my characters.",
                "I'm really overengineer my personal website lmao..."
            ],
            "image": {
                "src": "content/img/feed/wiki_update.png",
                "style": "square",
                "width": 300
            }
        },
        {
            "title": "Improvement",
            "date": "16.06.2024",
            "text": [
                "Hii, maybe it's not something most people would notice on my website, but I refactored some code, and turned it into a single page application. Transitions between pages should now be more seamless!", 
                "And as a result development is also made easier, with some tiny compromises, but the codebase for the website is more maintainable now, which is of most importance."
            ],
            "image": {
                "src": "content/img/feed/js_meme.png",
                "style": "square",
                "width": 300
            }
        },
        {
            "title": "Feed is up!!!!",
            "date": "15.06.2024",
            "text": [
                "This is the section of my website that I will use for posting some updates, maybe on some projects, or just to drop some random thoughts! Not sure how often there will be anything new, but I've been actively working on improving development environment for this website, and I haven't been so passionate about developing something for a while.", 
                "There are also some little mods I'm working on and off with my friend, so if I have any meaningful updates on these they will also appear here and also in Upcoming Projects section... So... stay tuned! Also... enjoy the cute foxingtons flying around!"
            ],
            "image": {
                "src": "content/img/feed/i_am_an_idiot.png",
                "style": "square",
                "width": 300
            }
        }
    ]
}