{
    "posts": [
        {
            "title": "New Mod!!",
            "date": "20.06.2024",
            "text": [
                "I released a new small mod that changes the way respawn mechanics work by respawningrandomizing the respawn location after each death.",
                "You can read more about what config potion you can change on the CurseForge, GitHub, or info in the Projects tab."
            ],
            "image": {
                "src": "content/img/feed/random-respawns.png",
                "style": "square",
                "width": 150
            }
        },
        {
            "title": "Hit Indicate my Balls",
            "date": "19.06.2024",
            "text": [
                "Today I've been porting my Hit Indication mod to a new Minecraft version 1.21... Usually takes like an hour max: Forge setup, it would do all the decomp for the first time (20 minutes), I would copy all the files from previous version, change a few method names here and there, and I would be good to go...",
                "Well... decomp did take 20 minutes... to then throw an OutOfMemory exception... after like an hour of trying giving it more RAM, and waiting, I figured I had to set Java version in IntelliJ to Java21, and then the exception didn't happen.",
                "Ok... now the copying thing, just a few changes with how some objects are created and how you get potion effects from the item stack, not that hard... except for when it came to the main thing - <b>RENDERING THE INDICATORS</b>. They completely removed any event related to Gui redering, and I only found out why when I looked through the forge commit history, because Mojang implemented a better system for layered GUI rendering... which, ofcourse, they didn't leave any API to access... Long story short, I ended up using mixins, for a mod that was going strong without them for a while.",
                "And then I find out that those APIs do exist in NeoForge, and Forge API feature request template even links to NeoForge Discord server, and to this day I was really confused about what's even the reason there are two different incompatable forks of forge, and it's some drama or something... Maybe I do need to move to NeoForge instead for newer versions of Minecraft idk.",
                "Anyway, rant over, been quite a ride today, Hit Indication for 1.21 is out, probably not a big deal, but it IS FOR ME!! Also might release a smaller mod at request of a friend that respawns you in a random location each time you die for 1.18.2, nothing big."
            ],
            "image": {
                "src": "content/img/feed/out_of_memory.png",
                "style": "square",
                "width": 300
            }
        },
        {
            "title": "Wiki Section",
            "date": "17.06.2024",
            "text": [
                "New website update! Replaced character secion with Wiki Section! Currently there's not a lot written, and a lot of the pages are pretty empty, but in the future I do plan on expanding the universe of my characters.",
                "I'm really overengineer my personal website lmao..."
            ],
            "image": {
                "src": "content/img/feed/wiki_update.png",
                "style": "square",
                "width": 300
            }
        },
        {
            "title": "Improvement",
            "date": "16.06.2024",
            "text": [
                "Hii, maybe it's not something most people would notice on my website, but I refactored some code, and turned it into a single page appplication. Transitions between pages should now be more seemless!", 
                "And as a result developement is also made easier, with some tiny compromises, but the codebase for the website is more maintainable now, which is of most importance."
            ],
            "image": {
                "src": "content/img/feed/js_meme.png",
                "style": "square",
                "width": 300
            }
        },
        {
            "title": "Feed is up!!!!",
            "date": "15.06.2024",
            "text": [
                "This is the section of my website that I will use for posting some updates, maybe on some projects, or just to drop some random thoughts! Not sure how often there will be anything new, but I've been actively working on imporving developement environment for this website, and I haven't been so passionate about developing something for a while.", 
                "There are also some little mods I'm working on and off with my friend, so if I have any meaningful updates on these they will also appear here and also in Upcoming Projects section... So... stay tuned! Also... enjoy the cute foxingtons flying around!"
            ],
            "image": {
                "src": "content/img/feed/i_am_an_idiot.png",
                "style": "square",
                "width": 300
            }
        }
    ]
}